# **Climate Project**

In [1]:
# Importazione librerie
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

## **Esplorazione dei Dati su le Emissioni di Gas Serra dei Paesi del’Unione Europea**

Dati mondiali sulla qualità dellʼaria dal 1990 al 2023.

In [4]:
# Caricamento dei dataset gas
datasets = {
    'CH4' : r'C:\Users\Mariapaola\Documents\CorsiAulab\Progetto finale\Dataset\emission_dataset(1970-2023)\CH4_Emissions.csv',
    'CO2' : r'C:\Users\Mariapaola\Documents\CorsiAulab\Progetto finale\Dataset\emission_dataset(1970-2023)\CO2_Emissions.csv',
    'GHG' : r'C:\Users\Mariapaola\Documents\CorsiAulab\Progetto finale\Dataset\emission_dataset(1970-2023)\GHG_Emissions.csv',
    'N2O' : r'C:\Users\Mariapaola\Documents\CorsiAulab\Progetto finale\Dataset\emission_dataset(1970-2023)\N2O_Emissions.csv',
    'NOx' : r'C:\Users\Mariapaola\Documents\CorsiAulab\Progetto finale\Dataset\emission_dataset(1970-2023)\NOx_Emissions.csv',
    'SO2' : r'C:\Users\Mariapaola\Documents\CorsiAulab\Progetto finale\Dataset\emission_dataset(1970-2023)\SO2_emissions.csv'
}

def load_datasets(dict_paths):
  '''Carica più dataset da un elenco di percorsi.'''
  datasets = {}
  for name, path in dict_paths.items():
    try:
      df = pd.read_csv(path)
      datasets[name] = df
      print(f"Il dataset {name} è stato caricato con successo. Righe: {df.shape[0]}")
    except FileNotFoundError:
      print(f"Il file {path} non è stato trovato.")
  return datasets

# Dizionario contenente i dataframe caricati
df_emissions = load_datasets(datasets)

Il dataset CH4 è stato caricato con successo. Righe: 190
Il dataset CO2 è stato caricato con successo. Righe: 191
Il dataset GHG è stato caricato con successo. Righe: 192
Il dataset N2O è stato caricato con successo. Righe: 189
Il dataset NOx è stato caricato con successo. Righe: 228
Il dataset SO2 è stato caricato con successo. Righe: 144

In [5]:
# Esplorazione dati
df_emissions['CH4'].head()

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Albania,1143.87,1183.56,1161.72,1256.43,1309.77,1313.34,1573.32,1602.93,1617.21,...,1984.17,1984.17,1984.16,1984.17,1984.17,1441.8,883.46,847.66,1513.89,1138.08
2,Algeria,NaN,NaN,NaN,NaN,18753.00,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Antigua and Barbuda,98.91,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df_emissions['CO2'].head()

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Albania,3101.66,5166.7,3311.06,3235.47,3500.49,3477.42,3341.56,3426.64,4139.06,...,5942.57,5942.57,5942.56,5942.57,5942.56,8715.51,5280.94,5239.62,9151.29,8798.25
2,Algeria,NaN,NaN,NaN,NaN,63705.00,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Antigua and Barbuda,288.14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df_emissions['GHG'].head()

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Albania,4341.63,6486.66,4581.28,4588.0,4906.36,4883.76,4998.58,5107.07,5830.67,...,8125.69,8125.7,8125.7,8125.7,8125.69,9921.61,5743.87,6580.85,10417.69,10031.01
2,Algeria,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Antigua and Barbuda,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df_emissions['N2O'].head()

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Albania,96.10,136.4,108.5,96.1,96.11,93.0,83.7,77.5,74.4,...,120.95,120.96,120.95,120.96,120.97,102.02,60.05,56.49,107.12,103.62
2,Algeria,NaN,NaN,NaN,NaN,9300.00,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Antigua and Barbuda,1.58,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
df_emissions['NOx'].head()

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Albania,17.85,21.11,15.63,16.16,18.85,18.17,18.16,19.37,23.7,...,48.5,48.49,48.49,48.49,48.5,42.81,25.33,24.23,44.95,43.55
2,Algeria,NaN,NaN,NaN,NaN,242.00,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Antigua and Barbuda,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df_emissions['SO2'].head()

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Albania,0.57,0.91,0.6,0.61,0.57,0.54,0.51,0.45,0.43,...,1.61,1.6,1.59,1.6,1.59,4.83,2.56,2.52,5.07,4.88
2,Algeria,NaN,NaN,NaN,NaN,39.69,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Antigua and Barbuda,2.83,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Argentina,79.20,NaN,NaN,NaN,99.97,NaN,NaN,96.37,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
df_emissions['CH4'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 190 entries, 0 to 189
Data columns (total 35 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  189 non-null    object
 1   1990     90 non-null     float64
 2   1991     65 non-null     float64
 3   1992     67 non-null     float64
 4   1993     70 non-null     float64
 5   1994     150 non-null    float64
 6   1995     79 non-null     float64
 7   1996     71 non-null     float64
 8   1997     72 non-null     float64
 9   1998     74 non-null     float64
 10  1999     69 non-null     float64
 11  2000     150 non-null    float64
 12  2001     69 non-null     float64
 13  2002     73 non-null     float64
 14  2003     73 non-null     float64
 15  2004     74 non-null     float64
 16  2005     88 non-null     float64
 17  2006     78 non-null     float64
 18  2007     71 non-null     float64
 19  2008     70 non-null     float64
 20  2009     68 non-null     float64
 21  2010     89 non-null     float64
 22  2011     65 non-null     float64
 23  2012     75 non-null     float64
 24  2013     67 non-null     float64
 25  2014     62 non-null     float64
 26  2015     61 non-null     float64
 27  2016     58 non-null     float64
 28  2017     55 non-null     float64
 29  2018     53 non-null     float64
 30  2019     45 non-null     float64
 31  2020     45 non-null     float64
 32  2021     45 non-null     float64
 33  2022     45 non-null     float64
 34  2023     45 non-null     float64
dtypes: float64(34), object(1)
memory usage: 52.1+ KB